Repository: sirily11/TheContractApp
Catalog: SmartContractApp/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: 1, 137, 56, etc.
zh_hans: 1，137，56，或者其他

source: 12 words
zh_hans: 12个字

source: 24 words
zh_hans: 24 个字

source: A friendly name for this contract instance
zh_hans: 为此合约实例设置一个友好的名称

source: A new wallet will be generated with a secure 12-word mnemonic phrase. Both the mnemonic and derived private key will be stored in your device's keychain.
zh_hans: 系统将生成一个包含安全 12 词助记词的新钱包。助记词和派生的私钥都将存储在您设备的钥匙串中。

source: ABI (Optional)
zh_hans: ABI（可选）

source: ABI Configuration
zh_hans: ABI配置

source: ABI Content
zh_hans: ABI内容

source: ABI Details
zh_hans: ABI详情

source: ABI JSON
zh_hans: ABI JSON格式

source: ABI Name
zh_hans: ABI名称

source: ABI name is required
zh_hans: ABI名称是必选项

source: ABI selected: %@
zh_hans: 选择的ABI：%@

source: Add Element
zh_hans: 添加一个元素

source: Add New ABI
zh_hans: 添加一个新的ABI

source: Add an ABI to interact with contract functions
zh_hans: 添加一个ABI来与合约交互

source: Address
zh_hans: 地址

source: Address:
zh_hans: 地址：

source: Addresses
zh_hans: 地址

source: All Functions
zh_hans: 全部函数

source: Amount
zh_hans: 金额

source: Anonymous
zh_hans: 匿名

source: Approve with %@
zh_hans: 使用 %@ 批准

source: Approved
zh_hans: 已批准

source: Are you sure you want to delete '%@'? This action cannot be undone.
zh_hans: 确定要删除 '%@' 吗？此操作无法撤销。

source: Are you sure you want to delete '%@'? This will also remove all associated keys from the keychain. This action cannot be undone.
zh_hans: 确定要删除 '%@' 吗？这将同时从钥匙串中移除所有相关密钥。此操作无法撤销。

source: Are you sure you want to reject this transaction?
zh_hans: 确定要拒绝此交易吗？

source: Array Elements
zh_hans: 数组元素

source: Assets
zh_hans: 资产

source: Authenticating...
zh_hans: 正在验证...

source: Auto-detect
zh_hans: 自动检测

source: Auto-detect (first contract)
zh_hans: 自动检测（第一个合约）

source: Available Balance
zh_hans: 可用余额

source: Back
zh_hans: 返回

# Balance: %@ %@
source: Balance: %1$@ %2$@
zh_hans: 余额：%1$@ %2$@

source: Base
zh_hans: 基础

source: Block
zh_hans: 区块

source: Bytecode
zh_hans: 字节码

source: Call
zh_hans: 调用

source: Call Function
zh_hans: 调用函数

source: Cancel
zh_hans: 取消

source: Chain ID
zh_hans: 链 ID

source: Chain ID: %@
zh_hans: 链 ID：%@

source: Choose a configuration category from the sidebar.
zh_hans: 从侧边栏选择一个配置类别。

source: Close
zh_hans: 关闭

source: Compilation Failed
zh_hans: 编译失败

source: Compiling Contract
zh_hans: 正在编译合约

source: Configurations
zh_hans: 配置

source: Confirm
zh_hans: 确认

source: Confirm Transaction
zh_hans: 确认交易

source: Connect a wallet to view assets
zh_hans: 连接钱包以查看资产

source: Connected Contracts
zh_hans: 已连接的合约

source: Connection Information
zh_hans: 连接信息

source: Connection Status
zh_hans: 连接状态

source: Constructor
zh_hans: 构造函数

source: Constructor Details
zh_hans: 构造函数详情

source: Constructor Parameters
zh_hans: 构造函数参数

source: Continue
zh_hans: 继续

source: Contract
zh_hans: 合约

source: Contract ABI
zh_hans: 合约 ABI

source: Contract Address
zh_hans: 合约地址

source: Contract Address:
zh_hans: 合约地址：

source: Contract Alias
zh_hans: 合约别名

source: Contract Bytecode
zh_hans: 合约字节码

source: Contract Call
zh_hans: 合约调用

source: Contract Call Details
zh_hans: 合约调用详情

source: Contract Details
zh_hans: 合约详情

source: Contract Functions
zh_hans: 合约函数

source: Contract Information
zh_hans: 合约信息

source: Contract Name
zh_hans: 合约名称

source: Contract Source Code
zh_hans: 合约源代码

source: Contract alias is required
zh_hans: 合约别名为必填项

source: Contract name is required
zh_hans: 合约名称为必填项

source: Contracts
zh_hans: 合约

source: Copied to clipboard
zh_hans: 已复制到剪贴板

source: Copy Address
zh_hans: 复制地址

source: Copy Hash
zh_hans: 复制哈希

source: Copy address
zh_hans: 复制地址

source: Copy to clipboard
zh_hans: 复制到剪贴板

source: Create
zh_hans: 创建

source: Create ABI
zh_hans: 创建 ABI

source: Create Random Wallet
zh_hans: 创建随机钱包

source: Created
zh_hans: 已创建

source: Created %@ ago
zh_hans: 创建于 %@ 前

source: Created:
zh_hans: 创建时间：

source: Created: %@
zh_hans: 创建时间：%@

source: Data
zh_hans: 数据

source: Decimal
zh_hans: 十进制

source: Decimals
zh_hans: 小数位数

source: Delete
zh_hans: 删除

source: Delete ABI
zh_hans: 删除 ABI

source: Delete Contract
zh_hans: 删除合约

source: Delete Endpoint
zh_hans: 删除端点

source: Delete Wallet
zh_hans: 删除钱包

source: Deploy
zh_hans: 部署

source: Deploy Solidity Contract
zh_hans: 部署 Solidity 合约

source: Deploy from Bytecode
zh_hans: 从字节码部署

source: Deploying Contract
zh_hans: 正在部署合约

source: Deployment Configuration
zh_hans: 部署配置

source: Deployment Failed
zh_hans: 部署失败

source: Deployment Progress
zh_hans: 部署进度

source: Deployment Successful
zh_hans: 部署成功

source: Deployment Successful!
zh_hans: 部署成功！

source: Derived Address
zh_hans: 派生地址

source: Detect Again
zh_hans: 重新检测

source: Detect Chain ID
zh_hans: 检测链 ID

source: Detected Chain ID:
zh_hans: 检测到的链 ID：

source: Detecting chain ID...
zh_hans: 正在检测链 ID...

source: Detection failed
zh_hans: 检测失败

source: Done
zh_hans: 完成

source: Download
zh_hans: 下载

source: Downloaded: %@
zh_hans: 下载时间：%@

source: ETH Transfer
zh_hans: ETH 转账

source: ETH, BNB, MATIC, etc.
zh_hans: ETH、BNB、MATIC 等

source: Edit
zh_hans: 编辑

source: Edit ABI
zh_hans: 编辑 ABI

source: Edit Contract
zh_hans: 编辑合约

source: Encoded Data
zh_hans: 编码数据

source: Endpoint
zh_hans: 端点

source: Endpoint Configuration
zh_hans: 端点配置

source: Endpoint Details
zh_hans: 端点详情

source: Endpoint URL
zh_hans: 端点 URL

source: Endpoints
zh_hans: 端点

source: Enter ABI name
zh_hans: 输入 ABI 名称

source: Enter ABI name (e.g., ERC20 Token)
zh_hans: 输入 ABI 名称（例如：ERC20 Token）

source: Enter URL
zh_hans: 输入 URL

source: Enter URL first to detect chain ID
zh_hans: 请先输入 URL 以检测链 ID

source: Enter contract alias
zh_hans: 输入合约别名

source: Enter contract name
zh_hans: 输入合约名称

source: Enter endpoint name
zh_hans: 输入端点名称

source: Enter string value
zh_hans: 输入字符串值

source: Enter the ABI as a JSON array
zh_hans: 以 JSON 数组格式输入 ABI

source: Enter the amount of %@ to send with this transaction
zh_hans: 输入此交易要发送的 %@ 数量

source: Enter the compiled bytecode (must start with 0x)
zh_hans: 输入编译后的字节码（必须以 0x 开头）

source: Enter the constructor parameters for your contract. These values will be used when deploying the contract to the network.
zh_hans: 输入合约的构造函数参数。这些值将在部署合约到网络时使用。

source: Enter wallet name
zh_hans: 输入钱包名称

source: Enter your Solidity source code. It will be compiled during deployment.
zh_hans: 输入您的 Solidity 源代码。它将在部署过程中编译。

source: Error
zh_hans: 错误

source: Error:
zh_hans: 错误：

source: Errors
zh_hans: 错误

source: Estimated Gas
zh_hans: 预估 Gas

source: Estimating Gas
zh_hans: 正在估算 Gas

source: Ethereum, Binance Coin, Polygon, etc.
zh_hans: 以太坊、币安币、Polygon 等

source: Events
zh_hans: 事件

source: Failed
zh_hans: 失败

source: Failed to load versions: %@
zh_hans: 加载版本失败：%@

source: Failed to parse ABI
zh_hans: 无法解析 ABI

source: Fixed size: %lld
zh_hans: 固定大小：%lld

source: From
zh_hans: 发送方

source: Function
zh_hans: 函数

source: Function call history will appear here
zh_hans: 函数调用历史将显示在这里

source: Functions
zh_hans: 函数

source: Gas
zh_hans: 燃料

source: Gas Estimation Failed
zh_hans: 预估燃料费失败

source: Gas Price
zh_hans: 燃料单价

source: Gas Used
zh_hans: Gas 使用量

source: Gas estimate not available
zh_hans: 预估燃料暂不可用

source: Go Back
zh_hans: 返回

source: Hash
zh_hans: 哈希值

source: Hexadecimal
zh_hans: 十六进制

source: Hide
zh_hans: 隐藏

source: History
zh_hans: 历史记录

source: Import Existing Contract
zh_hans: 导入现有合约

source: Import from Mnemonic
zh_hans: 从助记词导入

source: Import from Private Key
zh_hans: 从私钥导入

source: Input Method
zh_hans: 输入方式

source: Inputs:
zh_hans: 输入：

source: Insufficient balance
zh_hans: 余额不足

source: Invalid Ethereum address
zh_hans: 无效的以太坊地址

source: Invalid address format. Must be 0x followed by 40 hex characters.
zh_hans: 无效的地址格式。必须是 0x 开头加 40 个十六进制字符。

source: Last Result:
zh_hans: 最后结果：

source: Last Updated
zh_hans: 最后更新

source: Load More
zh_hans: 加载更多

source: Loading...
zh_hans: 正在加载...

source: Max
zh_hans: 最大

source: Metadata
zh_hans: 元数据

source: Mnemonic
zh_hans: 助记词

source: Mnemonic Phrase
zh_hans: 助记词短语

source: Mnemonic Words
zh_hans: 助记词

source: Most chains use 18 decimals
zh_hans: 大多数链使用 18 位小数

source: Name
zh_hans: 名称

source: Native Token Configuration
zh_hans: 原生代币配置

source: Network
zh_hans: 网络

source: Network Fee
zh_hans: 网络费用

source: Network chain ID (e.g., 1 for Ethereum Mainnet)
zh_hans: 网络链 ID（例如，以太坊主网为 1）

source: New Contract
zh_hans: 新合约

source: Next
zh_hans: 下一步

source: No
zh_hans: 否

source: No ABI associated
zh_hans: 未关联 ABI

source: No ABI selected
zh_hans: 未选择 ABI

source: No ABIs available
zh_hans: 没有可用的 ABI

source: No Assets
zh_hans: 无资产

source: No Constructor Parameters
zh_hans: 无构造函数参数

source: No Function Calls Yet
zh_hans: 尚无函数调用

source: No Parameters
zh_hans: 无参数

source: No Parameters Required
zh_hans: 无需参数

source: No Pending Transactions
zh_hans: 无待处理交易

source: No Selection
zh_hans: 未选择

source: No Transactions
zh_hans: 无交易

source: No additional data
zh_hans: 无额外数据

source: No components defined
zh_hans: 未定义组件

source: No contract selected
zh_hans: 未选择合约

source: No contracts found in source code
zh_hans: 源代码中未找到合约

source: No contracts using this ABI
zh_hans: 没有使用此 ABI 的合约

source: No data
zh_hans: 无数据

source: No elements
zh_hans: 无元素

source: No endpoint associated
zh_hans: 未关联端点

source: No endpoint selected
zh_hans: 未选择端点

source: No endpoints available
zh_hans: 没有可用的端点

source: No inputs
zh_hans: 无输入

source: No parameters
zh_hans: 无参数

source: No return values
zh_hans: 无返回值

source: No wallet available for deployment
zh_hans: 没有可用于部署的钱包

source: No wallet selected
zh_hans: 未选择钱包

source: OK
zh_hans: 确定

source: Parameters
zh_hans: 参数

source: Parameters (%lld)
zh_hans: 参数（%lld）

source: Parameters:
zh_hans: 参数：

source: Paste JSON ABI
zh_hans: 粘贴 JSON ABI

source: Paste the contract ABI JSON
zh_hans: 粘贴合约 ABI JSON

source: Pending
zh_hans: 待处理

source: Pending Signature
zh_hans: 待签名

source: Pending Transactions
zh_hans: 待处理交易

source: Please review the transaction details carefully before signing.
zh_hans: 签名前请仔细查看交易详情。

source: Please select an endpoint
zh_hans: 请选择一个端点

source: Please wait while your transaction is confirmed on the network
zh_hans: 请稍候，您的交易 正在网络上确认中

source: Preview
zh_hans: 预览

source: Preview is not available.
zh_hans: 预览不可用。

source: Private Key
zh_hans: 私钥

source: Private Key (64 hex characters)
zh_hans: 私钥（64 个十六进制字符）

source: Processing
zh_hans: 处理中

source: Processing Transaction
zh_hans: 正在处理交易

source: QR Code
zh_hans: 二维码

source: Random Wallet
zh_hans: 随机钱包

source: Raw Data
zh_hans: 原始数据

source: Read Functions
zh_hans: 读取函数

source: Receive
zh_hans: 接收

source: Recipient Address
zh_hans: 收款地址

source: Refresh
zh_hans: 刷新

source: Refresh version list
zh_hans: 刷新版本列表

source: Reject
zh_hans: 拒绝

source: Reject Transaction
zh_hans: 拒绝交易

source: Rejected
zh_hans: 已拒绝

source: Remove element
zh_hans: 移除元素

source: Required: %lld bytes
zh_hans: 需要：%lld 字节

source: Result
zh_hans: 结果

source: Result:
zh_hans: 结果：

source: Retry
zh_hans: 重试

source: Retry Connection
zh_hans: 重新连接

source: Retry Deployment
zh_hans: 重新部署

source: Returns:
zh_hans: 返回值：

source: Review Transaction
zh_hans: 审核交易

source: Review the transaction details before signing
zh_hans: 签名前审核交易详情

source: Save
zh_hans: 保存

source: Security
zh_hans: 安全

source: Select ABI
zh_hans: 选择 ABI

source: Select Asset to Send
zh_hans: 选择要发送的资产

source: Select Configuration
zh_hans: 选择配置

source: Select Contract
zh_hans: 选择合约

source: Select Endpoint
zh_hans: 选择端点

source: Select Endpoint...
zh_hans: 选择端点...

source: Select Network
zh_hans: 选择网络

source: Select Version
zh_hans: 选择版本

source: Select a configuration category from the sidebar
zh_hans: 从侧边栏选择一个配置类别

source: Select a contract to view and interact with its functions
zh_hans: 选择一个合约以查看并与其函数交互

source: Select a contract to view its details.
zh_hans: 选择一个合约以查看其详情。

source: Select an item to view its details.
zh_hans: 选择一项以查看其详情。

source: Select which contract to deploy from your Solidity code
zh_hans: 选择要从 Solidity 代码中部署的合约

source: Send
zh_hans: 发送

source: Share
zh_hans: 分享

source: Show
zh_hans: 显示

source: Show ABI Detail
zh_hans: 显示 ABI 详情

source: Sign & Send
zh_hans: 签名并发送

source: Sign Transaction
zh_hans: 签名交易

source: Signature
zh_hans: 签名

source: Solidity Contract Name
zh_hans: Solidity 合约名称

source: Solidity Source Code
zh_hans: Solidity 源代码

source: Solidity Version
zh_hans: Solidity 版本

source: Source
zh_hans: 源代码

source: State:
zh_hans: 状态：

source: Status
zh_hans: 状态

source: Status:
zh_hans: 状态：

source: Success
zh_hans: 成功

source: Summary
zh_hans: 摘要

source: Symbol
zh_hans: 符号

source: This contract has no constructor parameters. Click Next to proceed with deployment.
zh_hans: 此合约没有构造函数参数。点击下一步继续部署。

source: This function can be called without any parameters
zh_hans: 此函数可以在不带任何参数的情况下调用

source: This function has no input parameters
zh_hans: 此函数没有输入参数

source: Time
zh_hans: 时间

source: Timeline
zh_hans: 时间轴

source: Timing
zh_hans: 时间

source: To
zh_hans: 接收方

source: To: %@
zh_hans: 至：%@

source: Total Gas Cost
zh_hans: 总 Gas 费用

source: Transaction
zh_hans: 交易

source: Transaction Details
zh_hans: 交易详情

source: Transaction Failed
zh_hans: 交易失败

source: Transaction Hash:
zh_hans: 交易哈希：

source: Transaction Sent!
zh_hans: 交易已发送！

source: Transaction Value
zh_hans: 交易金额

source: Try Again
zh_hans: 重试

source: Tx Hash
zh_hans: 交易哈希

source: Tx: %@
zh_hans: 交易：%@

source: Type
zh_hans: 类型

source: Unit
zh_hans: 单位

source: Update
zh_hans: 更新

source: Updated:
zh_hans: 更新时间：

source: Upload
zh_hans: 上传

source: Valid ABI
zh_hans: 有效的 ABI

source: Validating...
zh_hans: 正在验证...

source: Validation Error
zh_hans: 验证错误

source: Value
zh_hans: 值

source: Value & Gas
zh_hans: 值与 Gas

source: Verifying endpoint connectivity...
zh_hans: 正在验证端点连接...

source: Version (e.g., 0.8.21)
zh_hans: 版本（例如，0.8.21）

source: Waiting for transaction confirmation...
zh_hans: 正在等待交易确认...

source: Wallet Details
zh_hans: 钱包详情

source: Wallet Information
zh_hans: 钱包信息

source: Wallet Name
zh_hans: 钱包名称

source: Wallets
zh_hans: 钱包

source: Word Count
zh_hans: 词数

source: Write Functions
zh_hans: 写入函数

source: Yes
zh_hans: 是

source: You can deploy without an ABI, but you won't be able to interact with the contract
zh_hans: 您可以在没有 ABI 的情况下部署，但将无法与合约交互

source: You don't have any transactions waiting for signature
zh_hans: 您没有等待签名的交易

source: Your Address
zh_hans: 您的地址

source: Your contract is now deployed
zh_hans: 您的合约现已部署

source: Your transaction has been successfully signed and broadcast to the network.
zh_hans: 您的交易已成功签名并广播到网络。

source: indexed
zh_hans: 已索引

# int%lld • range: %@ to %@
source: int%1$lld • range: %2$@ to %3$@
zh_hans: int%1$lld • 范围：%2$@ 至 %3$@

# uint%lld • max: %@
source: uint%1$lld • max: %2$@
zh_hans: uint%1$lld • 最大值：%2$@

source: word
zh_hans: 词

source: ⚠️ Never share your mnemonic phrase with anyone. Both the mnemonic and derived private key will be stored securely in the keychain.
zh_hans: ⚠️ 切勿与任何人分享您的助记词。助记词和派生的私钥都将安全存储在钥匙串中。

source: ⚠️ Never share your private key or mnemonic phrase with anyone.
zh_hans: ⚠️ 切勿与任何人分享您的私钥或助记词。

source: ⚠️ Never share your private key with anyone. It will be stored securely in the keychain.
zh_hans: ⚠️ 切勿与任何人分享您的私钥。它将安全存储在钥匙串中。

source: 💡 Tip: Make sure the Solidity contract name exactly matches a contract in your source code.
zh_hans: 💡 提示：确保 Solidity 合约名称与源代码中的合约完全匹配。
